In [1]:
import pandas as pd
import numpy as np

In [2]:
e=pd.Series()

/tmp/ipykernel_4081/2339862220.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  e=pd.Series()

In [3]:
type(e)

pandas.core.series.Series

In [4]:
df=pd.Series(['s','f',3,4])
df

0    s
1    f
2    3
3    4
dtype: object

In [5]:
type(df)

pandas.core.series.Series

In [10]:
l=["apple","banana","orange"]
s=pd.Series(l)
s

0     apple
1    banana
2    orange
dtype: object

In [11]:
type(s)

pandas.core.series.Series

In [48]:
s1=pd.Series(l,index=['a','b','c'])
s1

a     apple
b    banana
c    orange
dtype: object

In [14]:
a=np.array([1,2,3,4,5,6])
df1=pd.Series(a)
df1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [15]:
d={'a':1,'b':2,'c':3}
d

{'a': 1, 'b': 2, 'c': 3}

In [17]:
df2=pd.Series(d)
d

{'a': 1, 'b': 2, 'c': 3}

In [19]:
t=[('a', 1), ('b', 2), ('c', 3)]
t

[('a', 1), ('b', 2), ('c', 3)]

In [20]:
df3=pd.Series(t)
df3

0    (a, 1)
1    (b, 2)
2    (c, 3)
dtype: object

In [35]:
students={
    "Name": ["Hari","dsds","sdsds"],
    "occupation" :["Biologist","Student","Student"],
    "age": [25,20,18]
}
students

{'Name': ['Hari', 'dsds', 'sdsds'],
 'occupation': ['Biologist', 'Student', 'Student'],
 'age': [25, 20, 18]}

In [24]:
df4=pd.Series(students)
df4

Name                    [Hari, dsds, sdsds]
occupation    [Biologist, Student, Student]
age                            [25, 20, 18]
dtype: object

In [29]:
df4[0][0]

'Hari'

In [31]:
df5=pd.DataFrame(students)
df5

    Name occupation  age
0   Hari  Biologist   25
1   dsds    Student   20
2  sdsds    Student   18

In [39]:
ind=['p1','p2','p3']
col=['Name','Occupation','Age']

In [41]:
col

['Name', 'Occupation', 'Age']

In [49]:
df6 = pd.DataFrame(data=students,index=ind,columns=col)
df6

     Name Occupation  Age
p1   Hari        NaN  NaN
p2   dsds        NaN  NaN
p3  sdsds        NaN  NaN

In [57]:
df6 = pd.DataFrame.from_dict(students,orient='index',columns=ind)
df6.T

     Name occupation age
p1   Hari  Biologist  25
p2   dsds    Student  20
p3  sdsds    Student  18

In [58]:
df=pd.read_csv("/config/workspace/data/titanic.csv")
df.head()

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [60]:
df.shape

(891, 12)

In [61]:
df.columns

Index(['Id', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [62]:
df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [64]:
df['Pclass'].head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [65]:
df[['Name','Gender']]

                                                  Name  Gender
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [66]:
df[['Pclass','Gender']]

     Pclass  Gender
0         3    male
1         1  female
2         3  female
3         1  female
4         3    male
..      ...     ...
886       2    male
887       1  female
888       3  female
889       1    male
890       3    male

[891 rows x 2 columns]

In [67]:
df[['Name','Gender','Pclass']]

                                                  Name  Gender  Pclass
0                              Braund, Mr. Owen Harris    male       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female       1
2                               Heikkinen, Miss. Laina  female       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female       1
4                             Allen, Mr. William Henry    male       3
..                                                 ...     ...     ...
886                              Montvila, Rev. Juozas    male       2
887                       Graham, Miss. Margaret Edith  female       1
888           Johnston, Miss. Catherine Helen "Carrie"  female       3
889                              Behr, Mr. Karl Howell    male       1
890                                Dooley, Mr. Patrick    male       3

[891 rows x 3 columns]

In [69]:
col_range=list(range(5))
col_range

[0, 1, 2, 3, 4]

In [73]:
df1=df.iloc[:,0:5]
df1

,Id,Pclass,Name,Gender,Age
0,1,3,"Braund, Mr. Owen Harris",male,22.0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,3,"Heikkinen, Miss. Laina",female,26.0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,3,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,1,"Behr, Mr. Karl Howell",male,26.0
890,891,3,"Dooley, Mr. Patrick",male,32.0